// 1)მომხმარებელს შემოატანინეთ რიცხვი,1 იდან მომხმარებლის მიერ შემოტანილ რიცხვამდე დაატრიალეთ ლუპი და ჩაამატეთ ეს როცხვები სიაში,შემდეგ ამ სიიდან დაბეჭდეთ მხოლოდ ლუწი რიცხვები
 

let b = Number(prompt('enter number: '));
let arr = [];

for(let i = 1; i <= b; i ++){
    arr.push(i)
};

for(let i of arr){
    if(i % 2 == 0){
        console.log(i)
    }
};

console.log('-----------------------------');







// 2)მომხმარებელს შემოატანინე რიამე რიცხვი 1იდან 10 მდე,თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის ლუწი,მაგ შემთხვევაში დაატრიალეთ ფორ ლუპი და ამ რიცხვიდან 50 მდე გამოიტანეთ ყველა ლუწი რიცხვი,და თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის კენტი,მაშინ დაატრიალეთ WHILE LOOP ამ რიცხვიდან 50 მდე და გამოიტანეთ ყველა კენტი რიცხვი

let num = Number(prompt('enter eny number from 1 to 10'));

if(num % 2 == 0){
    for(let i = num; i <= 50; i ++){
        if(i % 2 == 0){
            console.log(i)
        };
    };
}else{
    while(num != 50){
        if(num % 2 != 0){
            console.log(num)
        }
        num ++
    }
};

console.log('-----------------------------');











// 3)მომხმარებელს შემოატანინეთ რიცხვი,შემდეგ დაატრუალეთ ფორ ციკლი 1 იდან მომხმარებლის მიერ შემოტანილ რიცხვამდე და იპოვე ამ რიცხვების საშუალო არითმეტიკული,შემდეგ შეამოწმეთ,თუ მიღებული საშვალო არის 20ზე მეტი და ლუწი,მაშინ დააკონსოლლოგე რომ "good mark" შემდეგ შეამოწმეთ თ რს მიღებული საშვალო არის 20 ზე ნაკლები და კენტი დაუკონსოლლოგეთ --> 'very bad mark"

let num2 = Number(prompt('enter number 2'));

let sum = 0;
let count = 0;

for(let i = 1; i <= num2; i ++){
    sum += i;
    count ++;
}

let n = sum / count


console.log(sum, count, n)
if(n > 20 && n % 2 == 0){
    console.log("good mark")
}else{
    console.log('very bad mark')
};