// 1)while loop ის დახმარებით დაბეჭდეთ რიცხვ ები 1 დან 100მდე
let num = 0;
while(num <= 100){
    console.log(num);
    num ++
}


console.log('----------------------------------------')


// 2)while loop ის დახმარებით დაბეჭდეთ 192000757

// 1 I Love You
// 2 I Love You
// 3 I Love You 
// ... 
// 192000757 I Love You

let num2 = 0;

while(num2 <= 197){
    console.log(`${num2} i love u`);
    num2 ++
}
console.log('192000757 I Love You')

console.log('----------------------------------------')








// 3)მომხმარებელს შეეკითხეთ რიცხვი,შემდეგ 1 დან მომხმ შემოტანილ რიცხვამდე დაბეჭდეთ ყველა რიცხვი 
let number = Number(prompt('enter number: '));
for(let i = 0; i <= number; i ++){
    console.log(i)
};

console.log('----------------------------------------')





// 4))მომხმარებელს შეეკითხეთ რიცხვი,შემდეგ 1 დან მომხმ შემოტანილ რიცხვამდე დაბეჭდეთ ლუწი რიცხვები

for(let i = 0; i <= number; i ++){
    if(i % 2 == 0){
        console.log(i)
    }
};
console.log('----------------------------------------')







// 5)მომხმარებელს შეეკითხეთ რიცხვი,შემდეგ 1 დან მომხმ შემოტანილ რიცხვამდე დაბეჭდეთ კენტი რიცხვები 
for(let i = 0; i <= number; i ++){
    if(i % 2 != 0){
        console.log(i)
    }
};

console.log('----------------------------------------')





// 6)მომხმარებელს შეეკითხეთ რიცხვი,შემდეგ 1 დან მომხმ შემოტანილ რიცხვამდე დაბეჭდეთ   რიცხვები დამიუწერეთ გვერდით ლუწია თუ კენტი
for(let i = 0; i <= number; i ++){
    if(i % 2 == 0){
        console.log(`${i} even`)
    }else{
        console.log(`${i} odd`)
    }
};

console.log('----------------------------------------')




// 7)100 დან ქვემოთ დაითვალეთ რიცხვები while loop ის დახმარებით

let n = 100;
while(n != 0){
    console.log(n);
    n --
}
console.log('----------------------------------------')



let sum = 0;
for(let i = 0; i <= number; i ++){
    sum += i;
}
console.log(sum)