// 1)შექმენი სია,სადაც შეინახავ 10 ცალ ელემენტს(მონაცემთა ტიპს არ აქვს მნიშვნელობა),თქვენი დავალებაა რომ მიწვდეთ სიაში თითიეულ ელემენტს ინდექსის დახმარებით და გამოიტანოთ კონსოლში 10 ივე მათგანი

let array = [1, 'tr', true, 45, 4, 'fed', 4, false, 45, 345];

for(let i = 0; i < array.length; i ++){
    console.log(array[i]);
}

console.log('--------------------------');










// 2)შექმენი სია -->  [20 , "giorgi" , 16 , 60.7 , "tbilisi" , "jora"]

// შენი დავალებაა რომ ინდექსების დახმარებით გამოიტანო ყველა ელემენტი სიიდან და გამოიტანო კონსოლში while loop დახმარებით

// შენი დავალებაა რომ giorgi შეცვალო "irakli" ით ,16 შეცვალო 90 ით და jora შეცვალო givia თი,ამ ყველაფერს რომ შეცვლი გამოიტანე საბოლოო შეცვლილი სია

let arr = [20 , "giorgi" , 16 , 60.7 , "tbilisi" , "jora"];

let i = 0;

while(i < arr.length){
    if(arr[i] == 'giorgi'){
        arr[i] = 'irakli'
    }else if(arr[i] == 16){
        arr[i] = 90
    }else if(arr[i] == 'jora'){
        arr[i] = 'givia'
    }
    console.log(arr[i])
    i ++
}
