// 1)შექმენი სია სადაც მოცემული გექნება 10 სტრინგ ტიპის მონაცემი

// შენი დავალებაა რომ -->

// ----ამოშალო სიის ბოლოდან ელემენტი

// ----ჩაამატო სიის ბოლოში "taxi"

// ---- ამოშალო სიის დასაწყისიდან ელემენტი

// ----წდაამატო სიის დასაწყისში "iremi" 

// ბოლოს დააკონსოლლოგეთ საბოლოო სია 

let arr = ['rttr', 'rtrtr', 'wsvfer', 'rfvdsfe', 'rttr', 'rtrtr', 'wsvfer', 'rfvdsfe', 'dfbge', 'rgfedw'];

arr.pop();
arr.push('taxi');
arr.shift()
arr.unshift('iremi');

console.log(arr);









// 2)შექმენით ფუნქცია რომელსაც გადაეცემა სტრინგების სია,სადაც მოთავსებული იქნება 10 სტრინგი,

// შენი დავალებაა რომ -->

// ---გაიგო ამ სიის სიგრძე

// ---გამოიტანო მე3 ინდექსიდან მე8 ინდექსამდე ელემენტები

// ---გამოიტანო მე 4 ე ინდექსიდან 3 ელემენტი

const func1 = (arr)=>{
    console.log(`length of the array is ${arr.length}`);
    for(let i = 3; i <= 8; i ++){
        console.log(arr[i])
    };
    for(let i = 4; i <= 6; i ++){
        console.log(arr[i]);
    }
};

func1([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])












// 3)შექმენი ფუნქცია,გადაეცი ორი სია,ერთი სტრინგების ერთ რიცხვების,შენი დავალებაა რომ გააერთიანო ეს ორი სია ერთმანეთში და მასე დააბრუნო

const func2 = (arrStr, arrInt)=>{
    let newArr = arrStr.concat(arrInt);
    return newArr
}

console.log(func2([1,2,3], ['t', 'o', 'k']));
