// 1)შექმენით ფუნქცია ,შემდეგ შექმენი ცვლადი საცაც შეინახავთ თქვენს სახელს,თქვენი დავალებაა რომ კონსოლში გამოიტანოთ hello {name}

let myName = 'tornike';

let greet = (name)=>{
    return `hello ${name}`
};

console.log(greet(myName))

console.log('------------------------------------------------------')




// 2)შექმენი ფუნქცია,შემდეგ შექმენით 3 ცვლადი,1 ში შეინახეთ სახელი მეორეში ასაკი და მესამეში საცხოვრებელია დგილი,თქვენი დავალებაა რომ ფუნქციამ კონსოლში გამოიტანოს hello , my name is {name} and i am {age} years old, i live in {city} , გამოიძახე ფუნქცია 5 ჯერ 

let age = 18;
let city = 'tbilisi';

let info = (name, age, city)=>{
    return `hello , my name is ${name} and i am ${age} years old, i live in ${city}`
};

for(let i = 0; i < 5; i ++){
    console.log(info(myName, age, city))
}
console.log('------------------------------------------------------')






// 3)შექმენი ფუნქცია,რომელსაც გადაეცემა ორი პარამეტრი , num1 და num2 , შენი დავლებაა რომ კონსოლში გამოიტანო ამ ორი რიცხვის ჯამი,გამოიძახე ფუნქცია 5 ჯერ და გადაეცი სხვადასხვა მნიშვნელობებია რგუმენტად

let sum = (num1, num2)=>{
    return num1 + num2
};

console.log(sum(2, 4));
console.log(sum(4, 5));
console.log(sum(5, 4));
console.log(sum(7, 1));
console.log(sum(9, 2));

console.log('------------------------------------------------------')









// 4)შექმენით ფუნქცია რომელსაც გადაეცემა ერთ პარამეტრი --> num1 ,შენი დავალებაა რომ დაატრიალო ფორ ლუპი 1 დან ამ პარამეტრში გადაცემულ ცვლადამდე(რიცხვამდე) და გამოიტანო თითეული რიცხვი კონსოლში,შემდე გამოიძახეთ ფუნქცია და არგუმკენტად გადაეცით სასურველი რიცხვი,გამოიძახეთ ფუნქცია 5 ჯერ და არგუმენტად გადაეცით განსხვაავებული რიცხვები

let loop = (num1)=>{
    for(let i = 0; i <= num1; i ++){
        console.log(i)
    };
};

loop(7);
console.log('-------')
loop(1);
console.log('-------')
loop(3);
console.log('-------')
loop(6);
console.log('-------')
loop(10);