// 1)დაწერე ფუნქცია, რომელიც იღებს არგუმენტად რიცხვების სიას და ახალ სიაში ამატებს მხოლოდ ლუწ რიცხვებს. შემდეგ იპოვეთ ამ სიაში მყოფი რიცხვების ჯამი

const func1 = (arr)=>{
    let newArr = [];
    for(let i of arr){
        if(i % 2 == 0){
            newArr.push(i);
        }
    }

    let sum = 0;
    for(let i of newArr){
        sum += i;
    }
    return sum;
}

console.log(func1([1,2,3,4]));

console.log('------------------------------')













// 2)შექმენი ფუნქცია, რომელიც იღებს არგუმენტად სტუდენტების სახელების სიას და სტუდენტის სახელს და ამ სიას ბოლოში ამატებს სტუდენტის სახელს.

const func2 = (arr, name)=>{
    arr.push(name);
    return arr
}

console.log(func2(['nika', 'saba'], 'luka'))

console.log('------------------------------');












// 3)შექმენი ფუქნცია რომელიც იღებს მოსწავლეების სიას,შენი დავალებაა რომ გაიგო --> თუ რომელიმე მოსწავლის სახელი იწყება ასო 'გ' ზე მაშინ ასეთი მოსწავლის სახელი შეცვალეთ false მნიშვნელობით

const func3 = (arr)=>{
    for(let i = 0; i < arr.length; i ++){
        if(arr[i][0] == 'g'){
            arr[i] = 'false';
        }
    }
    return arr
}

console.log(func3(['nika', 'gio', 'jaba']))

console.log('------------------------------');








// 4)შექმენი ფუნქცია რომელიც იღებს სტრინგს(სტრინგის სიგრძე მეტი უნდა იყოს 10 ზე) და რიცხვს,შენი დავალებაა რომ ამ სტრინგიდან გამოიტანო 0 ინდექსიდან იდან ფუნქციის პარამეტრში გადაცემულ რიცხვამდე(ინდექსამდე) მყოფი ასოები, გამოიყენე ნასწავლი ფუნქცია

const func4 = (str, num)=>{
    return str.slice(0, num)
}

console.log(func4('jajajaadse', 4))

console.log('------------------------------');








// 5)შექმენი ფუნქცია რომელიც იღებს სტრინგების სიას,შენი დავალებაა რომ შეამოწმო,თუ რომელიმე სტრინგის სიგრძე არის ლუწი რიცხვისგან შემდგარი მაშინ ასეთი სახელები ჩაამატეთ ახალ სიაში,ხოლო თუ რომელიმე სტრინგის სიგრძე არის კენტი რიცხვისგან შემდგარი ასეთი სტრინგები შეცვალე false მნიშვნელობით

const func5 = (arr)=>{
    let newArr = []
    for(let i = 0; i < arr.length; i ++){
        if(arr[i].length % 2 == 0){
            newArr.push(arr[i])
        }else{
            newArr.push(false)
        }
    }
    return newArr
}

console.log(func5(['sf9wd', 'ss', 'eiusfs', 'usniub']));

console.log('------------------------------');










// 6)დაწერე ფუნქცია, რომელიც იღებს სტუდენტების სახელების სიას და აბრუნებს(ითვლის) რამდენი სახელი იწყება ასო „გ“-ზე.


const func6 = (arr)=>{
    let count = 0;
    for(let i of arr){
        if(i[0] == 'g'){
            count ++
        }
    }
    return count
}

console.log(func6(['gio', 'alsefes', 'gedgs']))

console.log('------------------------------');








// 7)შექმენი ფუნქცია, რომელიც იღებს რიცხვების სიას და აბრუნებს ახალ სიას მხოლოდ იმ რიცხვებისგან შემდგარს, რომლებიც ერთდროულად ლუწებიც არიან და 5-ის ჯერადებიც,შემდეგ ამ სიაში მყოფი კენტი რიცხვების ჯამი იპოვეთ

const func7 = (arr)=>{
    let newArr = [];
    let count = 0;
    for(let i of arr){
        if(i % 2 == 0 & i % 5 == 0){
            newArr.push(i)
        }else if(i % 2 != 0){
            count ++
        }
    }
    return [newArr, count]
}

console.log(func7([1,2,3,4,5, 10]))

console.log('------------------------------');







// 8)დაწერე ფუნქცია, რომელიც იღებს სახელების სიას და აბრუნებს ახალ სიას მხოლოდ იმ სახელებისგან შემდგარს, რომლებსაც სიგრძე 5-ზე მეტია და არის ლუწი.შემდეგ შეამოწმეთამ ახალ სიაში მყოფი სახელებიდან თუ რომელიმე იწყება ასო "ა" ზე ასეთი ელემენტები ამოშალეთ სიიდან(ამაში გამოიყენეთ splice ფუნქცია,თუ მიხვდებით როგორ)

const func8 = (arr)=>{
    let newArr = [];
    for( let i = 0; i < arr.length; i ++){
        if(arr[i].length >= 5 & arr[i].length % 2 == 0){
            newArr.push(arr[i])

        }

    }
    for(let i = 0; i < newArr.length; i ++){
        if(newArr[i][0] == 'a'){
            newArr.splice(i, 1)
        }
    }
    return newArr
}

console.log(func8(['rrrrrr', 'rerere', 'asassa', 'dfgfdf']))

console.log('------------------------------');








// 9)შექმენით ფუნქცია რომელიც არგუმენტად იღებს ორ სიას(რიცხვების),თქვენი დავალებაა რომ იპოვოთ ორივე სიაში მყოფი რიცხვების ჯამი და შემდეგ შეადაროთ,თუ ამ ორი რიცხვის ჯამი მეტია 50 ზე და არის ლუწი მაშინ გამოიტანე შემდეგი ტექსტი --> "ორი რიცხვის ჯამი არის მაღალი და ეს რიცხვია ..." სხვა შემთხევაში გამოიტანეთ ---> 'ორი რიცხვის ჯამი არის ძალიან დაბალი და ეს რიცხვია ..."

const func9 = (arr1, arr2)=>{
    let sum = 0;
    for(let i of arr1){
        sum += i;
    }
    for(let i of arr2){
        sum += i;
    }
    if(sum > 50 & sum % 2 == 0){
        return `ორი რიცხვის ჯამი არის მაღალი და ეს რიცხვია ${sum}`
    }else{
        return `ორი რიცხვის ჯამი არის ძალიან დაბალი და ეს რიცხვია ${sum}`
    }
}

console.log(func9([12,3,35,5], [34,3,2]))