// cw1. დაატრიალეთ for loop 25 ჯერ და გამოიტანეთ თქვენი სახელი და გვარი ასეთ ფორმატში -->
// 1 გოგა
// 2 გოგა
// 3 გოგა
// ...

for(let i = 1; i <= 25; i ++){
    console.log(`${i}. tornike khozrevanidze`);
    
}



// cw2. 1 დან 100 მდე დაბეჭდეთ ყველა ლუწი რიცხვი

for(let i = 1; i <= 100; i ++){
    if(i % 2 === 0){
        console.log(i)
    }
}




// cw3. 1 დან 100 მდე დაბეჭდეთ ყველა კენტი რიცხი
for(let i = 1; i <= 100; i ++){
    if(i % 2 !== 0){
        console.log(i)
    }
}

// cw4. 1 დან 100 მდე დაბეჭდეთ ყველა რიცხვი მაგრამ თთოეულს მიუწერეთ გვერდით ლუწია თუ კენტი მაგ:

// 1 კენტი
// 2 ლუწი
// 3 კენტი
// 4 ლუწი

for(let i = 1; i <= 100; i ++){
    if(i % 2 === 0){
        console.log(`${i} even`)
    }else{
        console.log(`${i} odd`)
    }
}